OdGeCurve3d.appendSamplePoints(OdGeInterval!System.Runtime.CompilerServices.IsConst*,System.Double,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;System.Double,OdMemoryAllocator&lt;System.Double&gt;&gt;*)
\details
Appends sample points along this curve and their parameter values to the
specified arrays.
\param paramInterval [in]  Pointer to the parametric interval.
\param approxEps     [in]  Approximate spacing along a curve.
\param pointArray   [out]  Receives an array of sample points.
\param pParamArray  [out]  Receives an array of parameters at each point.
\remarks
If paramInterval is NULL, the current curve interval will be used.

OdGeCurve3d.getSplitCurves(System.Double,OdGeCurve3d**!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeCurve3d**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns pointers to the two curves that result from splitting this curve at
the point corresponding to param.
\param param   [in]  Parameter value corresponding to the split point.
\param piece1 [out]  Receives a pointer to the first curve.
\param piece2 [out]  Receives a pointer to the second curve.
\remarks
If param corresponds to a point not on this curve, or to the start point or
end point of this curve, piece1 and piece2 are set to NULL.
The curves pointed to by piece1 and piece2 are created with the new command,
and must be deleted by the caller.

OdGeCurve3d.getTrimmedOffset(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;OdSharedPtr&lt;OdGeCurve3d&gt;,OdObjectsAllocator&lt;OdSharedPtr&lt;OdGeCurve3d&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.OffsetCrvExtType,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves one or more trimmed offset curves.
\param distance         [in]  Offset distance.
\param planeNormal      [in]  A normal to the plane of this curve.
\param offsetCurveList [out]  Receives an array of trimmed offset curves.
\param extensionType    [in]  How curves will be extended at discontinuities of type C1.
\param tol              [in]  Geometric tolerance.
\remarks
The curve must be planar, and planeNomal must be perpendicular to the curve plane.
The direction of the positive offset at any point on this curve is along the cross
product of planeNormal and the tangent to the curve at that point.
The offsets are trimmed to eliminate self-intersecting loops.
If this curve has discontinuities of type C1 and offset curve is disjoint (e.g., polyline),
then offset curve's parts will be closed with lines or arcs
or they will be extended (depending on extensionType).
By default this function throws the exception "not Implemented". Should be
implemented in derived classes.
Throws:
Exception
eNotImplemented
eInvalidInput

OdGeCurve3d.paramOf(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the parameter value of a point.
\param point [in]  Point to be evaluated.
\param range [in]  Interval on the curve.
\param tol   [in]  Geometric tolerance.
\remarks
The returned parameter specifies a point within the tolerance of the point.
If the point is not on this curve, end or start of the interval will be set.
In case of uvBox == NULL paramOf(point, rng, tol) is called in which range -
native range of the curve. If you are not sure whether the point is on this
curve, use isOn() instead of this function.

OdGeCurve3d.paramOf(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the parameter value of a point.
\param point [in]  Point to be evaluated.
\param tol   [in]  Geometric tolerance.
\returns Parameter value of the point.
\remarks
The returned parameter specifies a point within the tolerance of the point.
If the point is not on this curve, the results are unpredictable.
If you are not sure whether the point is on this curve, use isOn() instead
of this function.
\remarks
If projection of the point does not lie in range-interval, the closest bound
of the interval is returned. In case of uvBox == NULL paramOf(point, tol) is
called.

OdGeCurve3d.getGeomExtents(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*)
\details
Returns the bounding box of the whole curve or a part of it. The box is
axis-aligned in the specified local coordinate system. It is guaranteed to
enclose the curve, but not guaranteed to be tight/minimal.
\param range       [in]  The part of the curve to be bounded.
\param coordSystem [in]  The local coordinate system in which box extents are computed.
\remarks
If the range is unbounded (e.g. by default), then the bounding box of the
whole curve (which range can be obtained by getInterval method) is computed.
Otherwise the bounding box is computed only for the set of points with
parameter in the specified range. If coordSystem is NULL (e.g. by default),
than the bounding box is aligned with global coordinate axes. Otherwise, the
box will be axis-aligned in the local coordinate system specified by the
coordSystem matrix.

OdGeCurve3d.closestPointTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval!System.Runtime.CompilerServices.IsConst*,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the point on this curve closest to the specified point.
\param point  [in]  Any 3D point.
\param param [out]  Parameter of closest point.
\param range  [in]  Interval of closest point.
\param tol    [in]  Geometric tolerance.
\remarks
Native interval is not considered.
If projection of the point does not lie in range-interval, the closest bound
of the interval is returned. In case of range == NULL
closestPointTo(point, param, range, tol) is called where range is a native curves
interval. An unbounded interval should not be used here.